{
  "data": [
    {
      "id": 2,
      "title": "Be careful, a routine may wear a time management mask!",
      "image": "https://media.licdn.com/media/gcrc/dms/image/C5612AQEM_SDay3NfWg/article-cover_image-shrink_600_2000/0?e=2125872000&v=beta&t=CQxm4M66SM-5x4v-MpNvQSDatpqTTHHGowgfevggWyM",
      "date": "Published on March 17, 2018",
      "content": "<p>One of the common traps that most of people inadvertently fall into is believing that they're managing their time daily by just repeating things over and over at specific periods of time. Eventually you discover that these repetitions transform you from a creative person to a routine one. So how can you determine whether you're following some routine or you're really managing your time correctly.</p> <p>First let's talk about why do people really need to manage their time. If you ask this question to different people who come from different environments you'll find the answers are concentrated around these couple of points: learning many things in a short time, providing more time to achieve some goal, to gain a new skill, working besides going to college, ...etc. If you take a deep look you'll find that those points are closely related. They're all about being good at something or achieving something. They're all about Performance and Objective.</p> <p>Performance is one of the key measures that indicates whether you're really getting a benefit from your daily routine or not. If you do things over and over and your performance is somehow constant. You might have a problem especially if you're in a career that requires continuous improvement and self-development. You must know that the way you measure your performance affects the person who you want to become in the future. If there's no clear measure for your performance based on your daily routines your performance may be improved randomly.</p> <p>Usually performance is not enough. You may improve your performance at something but without a clear understanding of how it's gonna benefit you in your career and life. And here comes the role of your objectives. You have to state a clear objective that describes what should be accomplished eventually after all of those repetitive tasks. It's not necessary to state a long term ones if you don't have. Short ones are okay as long as they give you some sort of indication about what you are doing.</p> <p>To sum up, in order not to fall into the routine trap. You have to find some effective performance measure for yourself with a clear objective about what should be accomplished daily and how it's gonna benefit your life and your career.</p>"
    },
    {
      "id": 1,
      "title": "Tips and tricks to quickly master the basics of a new technology",
      "image": "https://media.licdn.com/media/gcrc/dms/image/C5112AQFRoTTwyEwbbg/article-cover_image-shrink_720_1280/0?e=2128291200&v=beta&t=vd9fRKEXRHr-uz8mByHt5HhFNPztEm455HwF3_VruYM",
      "date": "Published on January 4, 2018",
      "content": "<p>In the last two years, one of the skills that I was really trying hard to improve is how to learn a new technology in a short time. The main challenge was not only about just learning the technology but also about mastering it. I think we all agree that self learning becomes one of the most effective and necessary skills which anyone should have. As a result of that, companies are no longer search for employees having that skill only but for those who have it and can do it fast.</p><p>A month ago I faced a situation in which I applied for a job as a software developer at some company and I've been asked to do some task with a new technology which I've never used before with a language which I wasn't familiar with. Guess what? I got the job. I've delivered the task before the deadline and got the basics of the technologies which I've learned in a way that really helped me after that to continue and keep learning.</p><p>So, here you are some tips and tricks which I personally use and prefer to master the basics of a new technology in a short time.</p><h3>80-20 Rule</h3><p>80-20 rule states that 80% of the situations and problems you face in some technology can be solved using only 20% of the tools provided. Yes sir, that's true and you do it every time you try to learn a new programming language by learning the basic syntax such as variables, datatypes, conditional statements, and loops. So, try to find a good resource that provides those 20% and personally I prefer textual resources, and DON'T even try to get into advanced topics at this point to not get yourself distracted.</p><h3>The Big Picture</h3><p>Now you have the appropriate resource and you want to start learning. Personally I prefer to start learning by scanning the topics, and by scanning I mean to read them fast because it helps you to get the big picture. It's something like breaking the ice between you and the technology. Besides it'll make some keywords and sentences stick to your mind earlier and this'll help you later.</p><h3>Learn and Apply Part by Part</h3><p>At this point start to learn each part separately and try hard to connect them in your mind to the big picture to get a well and a solid understanding. In addition to applying these parts by your hands.</p><h3>Focus, Focus, and Focus</h3><p>Don't do other activities while leaning and reading because it will waste your energy and you'll find yourself learning the technology slower than you expect.</p><h3>Don't Keep Yourself Curious</h3><p>While learning you'll find yourself struggling with keywords that you don't understand and you didn't see before, DON'T skip them. Skipping them will overwhelm you with a lot of things that you didn't get and at the end you'll find yourself upset and not be able to continue. At this moment Google is your best friend. Go and search for the meaning of each keyword you face and just get an abstract understanding of those keywords which helps you to continue, because we want to get it done as fast as we can.</p><h3>A Complete Project</h3><p>Now you got the whole picture with a solid understanding of the principles in addition to applying each part separately. It is the time to apply all of those parts in one project. Try to find some project to understand the interaction between the different elements you've learned and keep improving your understanding by doing research for the interactions that you don't understand and get the project done.</p><h3>Above 20%</h3><p>After applying the previous tips you'll have a solid understanding of the basics, and now you can learn advanced topics by applying different projects and searching for new solutions incrementally when you face a new problem. This'll make you exceed the 20% of basics and learn more.</p><p>That's it!</p><p>Thank you for reading and I hope this will help you!</p>"
    }
  ]
}
